# Chapter07 데이터 정제 및 준비

### 7.1 누락된 데이터 처리하기

In [119]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0]= None

In [7]:
string_data.isnull()  # null값을 bool형태로 알려줌

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

7.1.1 누락된 데이터 골라내기

In [120]:
from numpy import nan as NA  # 대충 NP.nan을 NA로 쓰겠다는 말

In [11]:
data = pd.Series([1,NA,3.5,NA,7])

In [12]:
data.dropna()  #  dropna(): 널이 아닌 데이터 반환

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all') # 모두 NA 값인 로우 제외

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1,how='all') # 컬럼 제외 시킴

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [121]:
df = pd.DataFrame(np.random.randn(7,3))

In [122]:
df

          0         1         2
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934
2  0.119827 -1.063512  0.332883
3 -2.359419 -0.199543 -1.541996
4 -0.970736 -1.307030  0.286350
5  0.377984 -0.753887  0.331286
6  1.349742  0.069877  0.246674

In [123]:
df.iloc[:4,1] = NA

In [124]:
df.iloc[:2,2] = NA

In [125]:
df

          0         1         2
0 -0.831154       NaN       NaN
1 -0.860757       NaN       NaN
2  0.119827       NaN  0.332883
3 -2.359419       NaN -1.541996
4 -0.970736 -1.307030  0.286350
5  0.377984 -0.753887  0.331286
6  1.349742  0.069877  0.246674

In [126]:
df.dropna()

          0         1         2
4 -0.970736 -1.307030  0.286350
5  0.377984 -0.753887  0.331286
6  1.349742  0.069877  0.246674

In [128]:
df.dropna(thresh=2) # tresh: n개 이상의 값이 들어있는 로우를 살펴보는 옵션

          0         1         2
2  0.119827       NaN  0.332883
3 -2.359419       NaN -1.541996
4 -0.970736 -1.307030  0.286350
5  0.377984 -0.753887  0.331286
6  1.349742  0.069877  0.246674

7.1.2 결측치 채우기

In [33]:
df.fillna(0) # fillna(): 빈 공간을 원하는 값으로 채워 넣음

          0         1         2
0 -0.050192  0.000000  0.000000
1  0.251627  0.000000  0.000000
2 -0.395995  0.000000  0.958536
3 -0.388754  0.000000  0.770692
4  0.641415 -0.478641 -0.436825
5  2.162591 -0.026164  0.583199
6 -1.081259 -0.450329 -0.692523

In [34]:
df.fillna({1:0.5, 2:0}) # 사전 값을 넘겨서 각 컬럼마다 다른 값을 채움

          0         1         2
0 -0.050192  0.500000  0.000000
1  0.251627  0.500000  0.000000
2 -0.395995  0.500000  0.958536
3 -0.388754  0.500000  0.770692
4  0.641415 -0.478641 -0.436825
5  2.162591 -0.026164  0.583199
6 -1.081259 -0.450329 -0.692523

In [35]:
_ = df.fillna(0, inplace = True) # _에 마지막 값을 저장

In [36]:
df

          0         1         2
0 -0.050192  0.000000  0.000000
1  0.251627  0.000000  0.000000
2 -0.395995  0.000000  0.958536
3 -0.388754  0.000000  0.770692
4  0.641415 -0.478641 -0.436825
5  2.162591 -0.026164  0.583199
6 -1.081259 -0.450329 -0.692523

In [37]:
df = pd.DataFrame(np.random.randn(6,3))

In [38]:
df

          0         1         2
0  0.048274 -1.702384  1.420694
1  0.711684  0.053209  2.535398
2 -1.802589 -0.014752  0.174953
3 -1.259116  0.611729 -1.254020
4 -0.966998 -0.338294 -0.969523
5 -1.597347 -0.075657 -0.686631

In [39]:
df.iloc[2:,1] = NA

In [40]:
df.iloc[4:,2] = NA

In [41]:
df

          0         1         2
0  0.048274 -1.702384  1.420694
1  0.711684  0.053209  2.535398
2 -1.802589       NaN  0.174953
3 -1.259116       NaN -1.254020
4 -0.966998       NaN       NaN
5 -1.597347       NaN       NaN

In [42]:
df.fillna(method = 'ffill') # 재색인에 사용 빈 공간을 앞의 값으로 채움

          0         1         2
0  0.048274 -1.702384  1.420694
1  0.711684  0.053209  2.535398
2 -1.802589  0.053209  0.174953
3 -1.259116  0.053209 -1.254020
4 -0.966998  0.053209 -1.254020
5 -1.597347  0.053209 -1.254020

In [44]:
df.fillna(method = 'ffill', limit = 2) # 2개까지로 제한 검

          0         1         2
0  0.048274 -1.702384  1.420694
1  0.711684  0.053209  2.535398
2 -1.802589  0.053209  0.174953
3 -1.259116  0.053209 -1.254020
4 -0.966998       NaN -1.254020
5 -1.597347       NaN -1.254020

In [47]:
data = pd.Series([1.,NA,3.5,NA,7])

In [48]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [49]:
data.fillna(data.mean()) # 데이터의 중간값으로 NaN 채움

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 7.2 데이터 변형

7.2.1 중복 제거하기

In [50]:
data = pd.DataFrame({'k1':['one','two']*3 +['two'],
                    'k2':[1,1,2,3,3,4,4]})

In [51]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [53]:
data.duplicated() # 중복 여부를 알려줌

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [54]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [55]:
data['v1'] = range(7)

In [56]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [57]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [60]:
data.drop_duplicates(['k1','k2'], keep = 'last') # keep='last': 마지막으로 발견된 값 반환 옵션

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [61]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

7.2.2 함수내 매핑을 이용해서 데이터 변형하기

In [71]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon',
                             'Pastrami','corned beef','Bacon',
                             'pastrami','honey ham','nova lox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [72]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [73]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef': 'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [74]:
lowercased = data['food'].str.lower() # str.lower()를 이용해 모두 소문자로 저장

In [75]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [76]:
data['animal'] = lowercased.map(meat_to_animal) # data의 'animal' 부분은 고기정보로 채움

In [77]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [80]:
lowercased.map(meat_to_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [79]:
data['food'].map(lambda x : meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

7.2.3 값 치환하기

In [81]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.]) # -999 == 누락된 값을 나타내기 위한 값

In [82]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [83]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [84]:
data.replace([-999,-1000],np.nan) # -1000도 비워라

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [85]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [86]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

7.2.4 축 색인 이름 바꾸기

In [97]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = ['Ohio','Colorado','New Yort'],
                   columns = ['one','two','three','four'])

In [98]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New Yort    8    9     10    11

In [100]:
transform = lambda x:x[:4].upper() # 슬라이싱값을 대문자로

In [101]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [102]:
data.index = data.index.map(transform)

In [103]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [104]:
data.rename(index = str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [105]:
data.rename(index = {'OHIO':'INDIANA'},
           columns = {'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [106]:
data.rename(index = {'OHIO':'INDIANA'}, inplace = True) #inplace = True : 원본 데이터를 바로 변경 옵션

In [107]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

7.2.5 개별화와 양자화

In [108]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [109]:
bins = [18,25,35,60,100]

In [110]:
cats = pd.cut(ages,bins) # bins 범위로 그룹을 나눔

In [111]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [112]:
cats.codes # 각 데이터들이 해당되는 카테고리 위치

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [113]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [115]:
pd.value_counts(cats) # 해당 카테고리에 들어있는 값의 개수
# 소괄호쪽의 값은 포함X , 대괄호 쪽의 값은 포함o

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [116]:
pd.cut(ages, [18,26,36,61,100], right = False) #right=False를 이용하여 기존의 포함 여부가 반대됨

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [117]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [118]:
pd.cut(ages,bins,labels=group_names) # 라벨의 그룹네임즈로 설정해라

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [119]:
data = np.random.rand(20)

In [121]:
pd.cut(data,4,precision=2) # 4개의 그룹으로 나누어라, precision=2: 소수점아래 2자리까지로 제한

[(0.25, 0.5], (0.74, 0.99], (0.74, 0.99], (0.00054, 0.25], (0.25, 0.5], ..., (0.74, 0.99], (0.00054, 0.25], (0.25, 0.5], (0.74, 0.99], (0.25, 0.5]]
Length: 20
Categories (4, interval[float64]): [(0.00054, 0.25] < (0.25, 0.5] < (0.5, 0.74] < (0.74, 0.99]]

In [122]:
data = np.random.randn(1000) # 정규 분포

In [123]:
cats = pd.qcut(data,4) # 4분위로 분류, qcut은 표본 변위치를 기반으로 데이터를 나눠줘서 분류된 그룹의 크기가 비슷허다

In [124]:
cats

[(0.719, 3.188], (-0.686, 0.0372], (0.719, 3.188], (0.719, 3.188], (0.0372, 0.719], ..., (-0.686, 0.0372], (-3.077, -0.686], (0.719, 3.188], (0.0372, 0.719], (-3.077, -0.686]]
Length: 1000
Categories (4, interval[float64]): [(-3.077, -0.686] < (-0.686, 0.0372] < (0.0372, 0.719] < (0.719, 3.188]]

In [125]:
pd.value_counts(cats)

(0.719, 3.188]      250
(0.0372, 0.719]     250
(-0.686, 0.0372]    250
(-3.077, -0.686]    250
dtype: int64

In [126]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(0.0372, 1.328], (-1.303, 0.0372], (1.328, 3.188], (0.0372, 1.328], (0.0372, 1.328], ..., (-1.303, 0.0372], (-1.303, 0.0372], (0.0372, 1.328], (0.0372, 1.328], (-1.303, 0.0372]]
Length: 1000
Categories (4, interval[float64]): [(-3.077, -1.303] < (-1.303, 0.0372] < (0.0372, 1.328] < (1.328, 3.188]]

7.2.6 특잇값을 찾고 제외하기

In [127]:
data = pd.DataFrame(np.random.randn(1000,4))

In [129]:
data.describe() # 각종 통계표시

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.016320     0.015293    -0.004930     0.040071
std       0.978329     1.000600     1.004776     1.032506
min      -4.243094    -3.038823    -2.987660    -3.037046
25%      -0.608326    -0.664068    -0.684497    -0.621142
50%       0.037240     0.009504     0.011724     0.060329
75%       0.643599     0.714856     0.702368     0.744842
max       2.742953     3.511934     3.542719     3.065075

In [130]:
col = data[2]

In [131]:
col[np.abs(col)>3] # col(data[2])의 값 중에서 절대값이 3보다 큰 값을 찾음

826    3.542719
897    3.027344
Name: 2, dtype: float64

In [134]:
data[(np.abs(data)>3).any(1)] #절대값이 3을 초과하는 값이 들어있는 모든 로우 선택(any(): 어느 하나라도 True면 True값 반환)

            0         1         2         3
52  -0.882432  3.511934  0.801417 -0.514098
116  0.227647  3.374829 -1.370826 -0.375543
548 -3.398050 -0.051580 -0.074505  0.552288
569 -1.130211 -3.038823  1.689071  1.675340
656 -4.243094 -0.399845 -1.744248 -0.195282
754 -0.111623  0.570228  0.473578  3.065075
826  1.548812 -2.628600  3.542719 -0.553420
897  0.073930  0.204579  3.027344 -1.149566
900 -0.561635 -0.924857  1.152016 -3.037046

In [135]:
data[np.abs(data)>3] = np.sign(data)*3  # sing(data): data값이 양,음수 여부에 따라 1,-1 반환

In [137]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017961     0.014445    -0.005500     0.040043
std       0.972373     0.997628     1.002920     1.032208
min      -3.000000    -3.000000    -2.987660    -3.000000
25%      -0.608326    -0.664068    -0.684497    -0.621142
50%       0.037240     0.009504     0.011724     0.060329
75%       0.643599     0.714856     0.702368     0.744842
max       2.742953     3.000000     3.000000     3.000000

In [138]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1 -1.0  1.0  1.0  1.0
2  1.0 -1.0  1.0  1.0
3  1.0 -1.0  1.0  1.0
4  1.0  1.0 -1.0  1.0

7.2.7  치환과 임의 샘플링

In [140]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [141]:
sampler = np.random.permutation(5) # permutation() 바뀐 순서가 담긴다

In [142]:
sampler

array([1, 4, 0, 3, 2])

In [143]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [144]:
df.take(sampler) #take 이용 순서 바꿈

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [148]:
df.sample(n=3) # 샘플 3개 뽑음

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11

In [129]:
choices = pd.Series([5,7,-1,6,4])

In [130]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [132]:
draws = choices.sample(n=10,replace=True) # 표본 10개 뽑음, replace=True: 반복  선택 허용

In [151]:
draws

1    7
2   -1
2   -1
3    6
1    7
3    6
4    4
3    6
4    4
2   -1
dtype: int64

7.2.8 표시자/더미 변수 계산하기

In [153]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                  'data1':range(6)})

In [154]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [155]:
pd.get_dummies(df['key']) # 0과 1을 이용하여 행렬로 표현

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [156]:
dummies = pd.get_dummies(df['key'], prefix = 'key') # prefix: 컬럼에 접두어 추가

In [160]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [157]:
df_with_dummy = df[['data1']].join(dummies) # data1과 dummies를 합침

In [159]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [4]:
mnames = ['movie_id','title','genres']

In [5]:
movies = pd.read_table('datasets\movielens\movies.dat',sep='::',header=None,names=mnames)

D:\Download\anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [6]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [7]:
all_genres = []

In [8]:
# movies의 장르를 올 장르에 추가해라
for x in movies.genres:
    all_genres.extend(x.split('l'))

In [9]:
genres = pd.unique(all_genres) # unique로 중복제외

In [10]:
genres

array(['Animation|Chi', "dren's|Comedy", 'Adventure|Chi',
       "dren's|Fantasy", 'Comedy|Romance', 'Comedy|Drama', 'Comedy',
       'Action|Crime|Thri', '', 'er', "dren's", 'Action',
       'Action|Adventure|Thri', 'Comedy|Drama|Romance', 'Comedy|Horror',
       'Drama', 'Action|Adventure|Romance', 'Drama|Thri', 'Drama|Romance',
       'Thri', 'Action|Comedy|Drama', 'Crime|Drama|Thri', 'Drama|Sci-Fi',
       'Romance', 'Adventure|Sci-Fi', 'Adventure|Romance', 'Chi',
       "dren's|Comedy|Drama", 'Documentary', 'Drama|War',
       'Action|Crime|Drama', 'Action|Adventure', 'Crime|Thri',
       "dren's|Musica", '|Romance', 'Action|Drama|Thri', 'Drama|Mystery',
       'Sci-Fi|Thri', 'Action|Comedy|Crime|Horror|Thri', 'Drama|Musica',
       'Crime|Drama|Romance', 'Adventure|Drama', 'Action|Thri',
       "dren's|Comedy|Musica", 'Action|Drama|War',
       'Action|Adventure|Crime', 'Crime', 'Drama|Mystery|Romance',
       'Action|Drama', 'Drama|Romance|War', 'Horror',
       'Action|Adventure|Comedy|Crime', 'Comedy|War',
       'Action|Adventure|Mystery|Sci-Fi', 'er|War', 'Action|Romance|Thri',
       'Crime|Fi', 'm-Noir|Mystery|Thri',
       'Action|Adventure|Drama|Romance', "dren's|Drama",
       'Action|Sci-Fi|Thri', 'Action|Adventure|Sci-Fi', 'Action|Chi',
       'Horror|Sci-Fi', 'Action|Crime|Sci-Fi', 'Western',
       "dren's|Comedy|Romance", 'Crime|Drama',
       'Drama|Fantasy|Romance|Thri', 'Drama|Horror', 'Comedy|Sci-Fi',
       'Mystery|Thri', "dren's|Comedy|Fantasy|Romance",
       'Action|Adventure|Fantasy|Sci-Fi', 'Drama|Romance|War|Western',
       'Action|Crime', 'Crime|Drama|Romance|Thri',
       'Action|Adventure|Western', 'Horror|Thri', "dren's|Comedy|Fantasy",
       'Fi', 'm-Noir|Thri', 'Action|Comedy|Musica', '|Sci-Fi',
       'Drama|Mystery|Thri', 'Comedy|Romance|War', 'Action|Comedy',
       "dren's|Romance", 'Comedy|Crime|Fantasy', 'Action|Comedy|Western',
       'Action|Sci-Fi', 'Action|Adventure|Comedy|Romance',
       'Comedy|Crime|Drama', 'Comedy|Thri', 'Horror|Sci-Fi|Thri',
       'Mystery|Romance|Thri', 'Comedy|Western', 'Drama|Western',
       'Action|Adventure|Crime|Thri', 'Action|Comedy|War',
       'Comedy|Mystery', 'Comedy|Mystery|Romance', 'Comedy|Drama|War',
       'Action|Drama|Mystery', 'Comedy|Crime|Horror', 'm-Noir|Sci-Fi',
       'Comedy|Romance|Thri', 'Action|Adventure|Chi', "dren's|Sci-Fi",
       'Action|Adventure|Comedy', 'Action|Crime|Romance',
       'Action|Adventure|Animation|Chi', 'Adventure|Drama|Western',
       'Action|Adventure|Crime|Drama',
       'Action|Adventure|Animation|Horror|Sci-Fi', 'Action|Horror|Sci-Fi',
       'War', 'Action|Adventure|Mystery', 'Mystery',
       'Action|Adventure|Fantasy', 'Adventure|Animation|Chi', 'Sci-Fi',
       'Documentary|Drama', 'Action|Adventure|Comedy|War', 'Animation',
       'Action|Adventure|Romance|Thri', 'Animation|Sci-Fi',
       'Animation|Comedy|Thri', 'm-Noir', 'Sci-Fi|War', 'Adventure',
       'Comedy|Crime', 'Action|Sci-Fi|War',
       'Comedy|Fantasy|Romance|Sci-Fi', 'Fantasy', 'Action|Mystery|Thri',
       'Comedy|Musica', 'Action|Adventure|Sci-Fi|Thri',
       "dren's|Drama|Fantasy", 'Adventure|War', 'Musica',
       'Comedy|Mystery|Romance|Thri', 'm-Noir|Mystery',
       "dren's|Drama|Musica", 'Drama|Mystery|Sci-Fi|Thri', 'Romance|Thri',
       'm-Noir|Romance|Thri', 'Adventure|Comedy',
       'Action|Adventure|Romance|War', 'Romance|War',
       'Action|Drama|Western', "dren's|Comedy|Western",
       "dren's|Comedy|Mystery", "dren's|Fantasy|Sci-Fi",
       "dren's|Drama|Fantasy|Sci-Fi", 'Action|Romance',
       'Adventure|Western', 'Comedy|Fantasy', 'Animation|Comedy',
       'Crime|Drama|Fi', 'Action|Adventure|Drama|Sci-Fi|War',
       'Action|Western', 'Action|Animation|Chi', "dren's|Sci-Fi|Thri",
       'Action|Adventure|Romance|Sci-Fi|War', 'Action|Horror|Sci-Fi|Thri',
       'Action|Adventure|Comedy|Horror|Sci-Fi', 'Mystery|Sci-Fi',
       'Adventure|Comedy|Drama', 'Action|Adventure|Comedy|Horror',
       'Action|Drama|Mystery|Romance|Thri', 'Comedy|Mystery|Thri',
       'Adventure|Animation|Sci-Fi|Thri', 'Action|Drama|Romance',
       'Action|Adventure|Drama', 'Comedy|Drama|Musica', 'Documentary|War',
       '|War', 'Action|Horror', 'Horror|Romance',
       'Action|Comedy|Sci-Fi|War', 'Crime|Drama|Sci-Fi',
       'Action|Romance|War', 'Action|Comedy|Crime|Drama',
       'Crime|Drama|Mystery', 'Action|Adventure|Comedy|Sci-Fi',
       'Action|Mystery|Sci-Fi|Thri', 'Action|Mystery|Romance|Thri',
       'Adventure|Thri', 'Action|Crime|Mystery', 'Horror|Mystery|Thri',
       'Crime|Horror|Mystery|Thri', 'Comedy|Drama|Thri',
       'Drama|Sci-Fi|Thri', 'Drama|Romance|Thri',
       'Action|Adventure|Sci-Fi|War', 'Comedy|Crime|Drama|Mystery',
       'Comedy|Crime|Mystery|Thri', 'm-Noir|Sci-Fi|Thri',
       'Adventure|Sci-Fi|Thri', 'Crime|Drama|Mystery|Thri',
       'Comedy|Documentary', 'Documentary|Musica',
       'Action|Drama|Sci-Fi|Thri', 'Adventure|Comedy|Romance',
       'Mystery|Sci-Fi|Thri', 'Action|Comedy|Crime', "dren's|Fantasy|War",
       'Action|Crime|Drama|Thri', 'Comedy|Sci-Fi|Western',
       "dren's|Fantasy|Musica", 'Fantasy|Sci-Fi', "dren's|Comedy|Sci-Fi",
       "dren's|Drama|Romance", "dren's|Comedy|Fantasy|Sci-Fi",
       'Drama|Fantasy', 'Adventure|Comedy|Musica', "dren's|Horror",
       'Comedy|Fantasy|Romance', 'Comedy|Crime|Thri',
       'Action|Crime|Mystery|Thri', 'Adventure|Musica',
       'Adventure|Fantasy|Romance', 'Crime|Horror',
       'Action|Adventure|Horror', 'Adventure|Fantasy|Sci-Fi', 'Drama|Fi',
       'Action|Comedy|Fantasy', 'Action|Adventure|Drama|Thri',
       'Crime|Horror|Thri', 'Animation|Musica', 'Action|War',
       'Action|Comedy|Romance|Thri', 'Comedy|Horror|Thri',
       'Drama|Horror|Thri', 'er|Western', 'Drama|Romance|Sci-Fi',
       'Action|Adventure|Horror|Thri', 'Comedy|Fi',
       'Comedy|Horror|Musica', 'Comedy|Romance|Sci-Fi',
       'Action|Comedy|Sci-Fi|Thri', 'Action|Sci-Fi|Western',
       'Crime|Mystery', 'Animation|Mystery', 'Action|Horror|Thri',
       'Action|Drama|Fantasy|Romance', 'Horror|Mystery', '|Romance|War',
       'Adventure|Drama|Romance', 'Adventure|Animation|Fi',
       'Action|Adventure|Animation', 'Comedy|Drama|Western',
       'Adventure|Comedy|Sci-Fi', 'Drama|Romance|Western',
       'Comedy|Drama|Sci-Fi', 'Action|Drama|Romance|Thri',
       'Adventure|Romance|Sci-Fi', 'm-Noir|Horror',
       'Action|Adventure|War', 'Romance|Western', 'Adventure|Drama|Thri',
       'Adventure|Fantasy', 'Action|Romance|Sci-Fi',
       'Comedy|Horror|Sci-Fi', 'Adventure|Drama|Romance|Sci-Fi',
       'Adventure|Animation|Sci-Fi', 'Adventure|Crime|Sci-Fi|Thri'],
      dtype=object)

In [11]:
zero_matrix = np.zeros((len(movies), len(genres))) # 영화,장르 크기의 0 생성

In [102]:
zero_matrix

array([[0., 0., 0., ..., 0., 0., 1.],
       [0., 0., 0., ..., 0., 0., 1.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 1.]])

In [12]:
dummies = pd.DataFrame(zero_matrix, columns = genres)

In [13]:
gen = movies.genres[0]

In [14]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [15]:
dummies.columns.get_indexer(gen.split('|'))

array([124,  -1,   6], dtype=int64)

In [18]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1

In [20]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [21]:
movies_windic.iloc[0]

movie_id                                                          1
title                                              Toy Story (1995)
genres                                  Animation|Children's|Comedy
Genre_Animation|Chi                                               0
Genre_dren's|Comedy                                               0
                                                   ...
Genre_Action|Romance|Sci-Fi                                       0
Genre_Comedy|Horror|Sci-Fi                                        0
Genre_Adventure|Drama|Romance|Sci-Fi                              0
Genre_Adventure|Animation|Sci-Fi                                  0
Genre_Adventure|Crime|Sci-Fi|Thri                                 1
Name: 0, Length: 271, dtype: object

In [22]:
np.random.seed(12345) # 난수 시드값 지정

In [23]:
values = np.random.rand(10)

In [24]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [25]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [27]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

### 문자열 다루기

7.3.1 문자열 객체 메서드

In [28]:
val = 'a,b,guido'

In [29]:
val.split(',')

['a', 'b', 'guido']

In [31]:
pieces = [x.strip() for x in val.split(',')] # strip(): 공백 문자 제가

In [32]:
pieces

['a', 'b', 'guido']

In [33]:
first, second, third = pieces

In [ ]:
# 문자 합치기

In [34]:
first + '::' +second+'::'+third

'a::b::guido'

In [35]:
'::'.join(pieces) #join 메서드를 이용해 문자 이어 붙임

'a::b::guido'

In [38]:
'guido' in val

True

In [39]:
val.index(',')

1

In [40]:
val.find(':') # find는 문자열이 없어도 예외 발생 x

-1

In [44]:
val.index(':') #index는 문자열을 찾지 못할 시 예외 발생

ValueError: substring not found

In [42]:
val.count(',')

2

In [45]:
val.replace(',','::') # 치환

'a::b::guido'

In [51]:
val.replace(',','')

'abguido'

7.3.2 정규 표현식

In [52]:
import re

In [53]:
text = "foo bar\t baz \tqux"

In [54]:
re.split('\s+', text) # split 구분자를 기준으로 리스트로 분리

['foo', 'bar', 'baz', 'qux']

In [55]:
regex = re.compile('\s+') #컴파일

In [56]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [57]:
regex.findall(text) #모든 패턴의 목록을 얻고 싶을 시 find all 사용

[' ', '\t ', ' \t']

In [58]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}' # 이게 대체 뭔소리야
# aaaaa @ aaa . aaa으로 이메일 패턴 찾는다는 말같은데 어떻게 쓰는지 모르겠다
regex = re.compile(pattern,flags=re.IGNORECASE) #IGNORECASE: 대소문자 안가림

In [59]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [108]:
m = regex.search(text) # 첫번째 이메일 주소만 찾아줌

In [109]:
m

In [112]:
text[m.start():m.end()] #첫번쨰 이베일 주소 시작점 부터 끝점까지

'dave@google.com'

In [113]:
text[m.start():m.end()-1]

'dave@google.co'

In [64]:
print(regex.match(text))

None

In [65]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [70]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern,flags = re.IGNORECASE)

In [71]:
m = regex.match('wesm@bright.net')

In [72]:
m.groups() # match()이용시 groups로 각 패턴 컴포넌트의 튜플 얻음

('wesm', 'bright', 'net')

In [73]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [74]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

7.3.3 pandas의 벡터화된 문자열 함수

In [92]:
data = {'Dave':'dave@google.com',
'Steve' :'steve@gmail.com',
'Rob': 'rob@gmail.com',
'Wes': np.nan}

In [93]:
data = pd.Series(data)

In [94]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [95]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [96]:
data.str.contains('gmail') # gmail 포함하는지 검사

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [97]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [98]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [99]:
matches = data.str.match(pattern,flags=re.IGNORECASE)

In [100]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [101]:
matches.str.get(1) #왜 에러가 뜨냐

AttributeError: Can only use .str accessor with string values!

In [90]:
matches.str[0] # 왜 뜨는거지ㅠ

AttributeError: Can only use .str accessor with string values!

In [91]:
data.str[:5] # 얘는 되는데....

Dave     dave@
Steve    steve
Rob      rob@g
Ryan     ryan@
Wes        NaN
dtype: object